app/views/drinks/new.html.erb

      ​<%= f.label :category_id %>
      <%= f.collection_select(:category_id, Category.all, :id, :name) %>
---
SELECT "categories".* FROM "categories"