app/controllers/drinks_controller.rb

  def create
    @drink = Drink.new(drink_params)
    if @drink.save
---
INSERT INTO "drinks" ("title", "description", "category_id", "alcohol_level", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def destroy
    @drink = Drink.find params[:id]
    @drink.destroy
---
SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = $1 LIMIT 1  [["id", 26]]
DELETE FROM "drinks" WHERE "drinks"."id" = $1  [["id", 26]]

  def index
    @drinks = Drink.all
---
SELECT "drinks".* FROM "drinks"